Classes | Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::PreferenceTableContainerBase Class Reference
MEP Element Manager
The PreferenceTableContainerBase contains PreferenceTables, and you can Add/Get/Delete them. More...
#include <MEPPreferenceTableContainerBase.hpp>
 Inheritance diagram for ACAPI::MEP::PreferenceTableContainerBase:
 Classes
class  | Modifier
Modifier of the PreferenceTableContainerBase. More...
 Public Member Functions
bool  | Exists () const
std::vector< UniqueID >  | GetPreferenceTables () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
PreferenceTableContainerBase (std::shared_ptr< Impl::IPreferenceTableContainerBaseImpl > impl)
Constructs a PreferenceTableContainerBase with the given base implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The PreferenceTableContainerBase contains PreferenceTables, and you can Add/Get/Delete them.
Since
Archicad 27
The containers for the three MEP domains are already initialized and you can get them from DuctPreferenceTableContainer, PipePreferenceTableContainer and CableCarrierPreferenceContainer
Example code snippet from Test / New MEP
Getters
 ACAPI::Result<DuctSegmentPreferenceTableContainer> ductSegmentContainer = GetDuctSegmentPreferenceTableContainer ();
 if (ductSegmentContainer.IsErr ())
 return ductSegmentContainer.UnwrapErr ().kind;
 std::vector<UniqueID> ductSegmentTableIds = ductSegmentContainer->GetPreferenceTables ();
 Modification
 Reporter preferenceReporter;
 ACAPI::Result<DuctSegmentPreferenceTableContainer> container = GetDuctSegmentPreferenceTableContainer ();
 if (container.IsErr ())
 return container.UnwrapErr ().kind;
 preferenceReporter.Add ("Adding a new table to the duct container...");
 ACAPI::Result<void> modifyResult = container->Modify ([&](PreferenceTableContainerBase::Modifier& modifier) -> GSErrCode {
 ACAPI::Result<UniqueID> tableId = modifier.AddNewTable ("Duct sizes - added from MEP_Test");
 if (tableId.IsErr ())
 return tableId.UnwrapErr ().kind;
 return NoError;
 }, "Modify the content of duct container.");
 if (modifyResult.IsErr ())
 return modifyResult.UnwrapErr ().kind;
 preferenceReporter.Add ("New table successfully added.");
Constructor & Destructor Documentation
◆ PreferenceTableContainerBase()
 ACAPI::MEP::PreferenceTableContainerBase::PreferenceTableContainerBase  |  ( |  std::shared_ptr< Impl::IPreferenceTableContainerBaseImpl > |  impl | )
protected
Constructs a PreferenceTableContainerBase with the given base implementation.
Parameters
impl | The given base implementation.
Member Function Documentation
◆ Exists()
 bool ACAPI::MEP::PreferenceTableContainerBase::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ GetPreferenceTables()
 std::vector< UniqueID > ACAPI::MEP::PreferenceTableContainerBase::GetPreferenceTables  |  ( |   | ) |   const
Returns
Returns the UniqueIDs of the PreferenceTables associated with the caller object's domain.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::PreferenceTableContainerBase::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.